# Statistics Basics PostClass1
## Working Questions

### importing seaborn module

In [4]:
import seaborn as sns

### listing datasets from seaborn module

In [5]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

### loading 'titanic' dataset within seaborn module and assign df value

In [6]:
df = sns.load_dataset('titanic')

### showing first 7 observation from titanic dataset

In [7]:
df.head(7)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True

### showing last 10 observation from titanic dataset

In [8]:
df.tail(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

### showing random 9 observation from titanic dataset

In [9]:
df.sample(9)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
553,1,3,male,22.0,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,yes,True
836,0,3,male,21.0,0,0,8.6625,S,Third,man,True,NaN,Southampton,no,True
681,1,1,male,27.0,0,0,76.7292,C,First,man,True,D,Cherbourg,yes,True
453,1,1,male,49.0,1,0,89.1042,C,First,man,True,C,Cherbourg,yes,False
218,1,1,female,32.0,0,0,76.2917,C,First,woman,False,D,Cherbourg,yes,True
404,0,3,female,20.0,0,0,8.6625,S,Third,woman,False,NaN,Southampton,no,True
761,0,3,male,41.0,0,0,7.1250,S,Third,man,True,NaN,Southampton,no,True
624,0,3,male,21.0,0,0,16.1000,S,Third,man,True,NaN,Southampton,no,True
829,1,1,female,62.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True

### listing shape (observersations, features) of titanic dataset

In [35]:
df.shape

(891, 15)

### listing all features (name, count, type) of titanic dataset

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

### listing just names of features of titanic dataset

In [11]:
columns = df.columns
print(columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

### listing just total observations of every features of titanic dataset

In [12]:
count = df.count()
print(count)

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### listing just type of every features of titanic dataset

In [13]:
types = df.dtypes
print(types)

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

### listing numerical features special information (count, mean, standard derivation, minimum/maximum value, interquartile ranges) of titanic dataset

In [37]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [79]:
df.describe().T

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

# working with bool feature

### listing just alone/adult_male feature information (total non-null entries, total entries, rangeindex start, type) of titanic dataset

In [27]:
df['alone'].info()
#df.alone.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: alone
Non-Null Count  Dtype
--------------  -----
891 non-null    bool
dtypes: bool(1)
memory usage: 1019.0 bytes

### listing alone feature all categories or values (NAN, etc.) of titanic dataset

In [29]:
df['alone'].unique()
#df.alone.unique()

array([False,  True])

### listing alone feature categories and total value of every category of titanic dataset

In [25]:
df['alone'].value_counts()
#df.alone.value_counts()

True     537
False    354
Name: alone, dtype: int64

### listing alone feature special information (count, unique numbers, top value and its frequency) of titanic dataset

In [43]:
df['alone'].describe()
#df.alone.describe()

count      891
unique       2
top       True
freq       537
Name: alone, dtype: object

# working with numerical (int64, float64, etc.) feature

### listing just survived/pclass/age/sibsp/parch/fare  feature information (total non-null entries, total entries, rangeindex start, type) of titanic dataset

In [49]:
df['survived'].info()
#df.survived.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: survived
Non-Null Count  Dtype
--------------  -----
891 non-null    int64
dtypes: int64(1)
memory usage: 7.1 KB

### listing survived feature all categories or values (NAN, etc.) of titanic dataset

In [57]:
df['survived'].unique()
#df.survived.unique()

array([0, 1], dtype=int64)

### listing survived feature categories and total value of every category of titanic dataset

In [63]:
df['survived'].value_counts()
#df.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

### listing survived feature special information (count, mean, standard derivation, minumum/maximum value and interquartile ranges)of titanic dataset

In [71]:
df['survived'].describe()
#df.survived.describe()

count    891.000000
mean       0.383838
std        0.486592
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        1.000000
Name: survived, dtype: float64

# working with object feature

### listing just sex/embarked/who/embark_town/alive feature information (total non-null entries, total entries, rangeindex start, type) of titanic dataset

In [51]:
df['sex'].info()
#df.sex.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: sex
Non-Null Count  Dtype
--------------  -----
891 non-null    object
dtypes: object(1)
memory usage: 7.1+ KB

### listing sex feature all categories or values (NAN, etc.) of titanic dataset

In [59]:
df['sex'].unique()
#df.sex.unique()

array(['male', 'female'], dtype=object)

### listing sex feature categories and total value of every category of titanic dataset

In [66]:
df['sex'].value_counts()
#df.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

### listing sex feature special information (count, unique numbers, top value and its frequency) of titanic dataset

In [73]:
df['sex'].describe()
df.sex.describe()

count      891
unique       2
top       male
freq       577
Name: sex, dtype: object

# working with category feature

### listing just deck/class feature information (total non-null entries, total entries, rangeindex start, type) of titanic dataset

In [53]:
df['deck'].info()
#df.deck.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: deck
Non-Null Count  Dtype
--------------  -----
203 non-null    category
dtypes: category(1)
memory usage: 1.3 KB

### listing deck feature all categories or values (NAN, etc.) of titanic dataset

In [61]:
df['deck'].unique()
#df.deck.unique()

[NaN, 'C', 'E', 'G', 'D', 'A', 'B', 'F']
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

### listing deck feature categories and total value of every category of titanic dataset

In [68]:
df['deck'].value_counts()
#df.deck.value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

### listing deck feature special information (count, unique numbers, top value and its frequency) of titanic dataset

In [75]:
df['deck'].describe()
#df.deck.describe()

count     203
unique      7
top         C
freq       59
Name: deck, dtype: object

count     203
unique      7
top         C
freq       59
Name: deck, dtype: object